/* Сделайте функцию, которая параметрами принимает 2 числа. Если эти числа равны - пусть функция вернет true, а если не равны - false. */

// function bull(a,b) {
//     return a == b ? true : false;
// }

// console.log(bull(1,2));

/* Сделайте функцию, которая параметрами принимает 2 числа. Если их сумма больше 10 - пусть функция вернет true, а если нет - false. */

// function sum(a,b) {
//     return (a + b) > 10 ? true : false;
// }
// console.log(sum(10,2));

/*  Сделайте функцию, которая параметром принимает число и проверяет - отрицательное оно или нет. Если отрицательное - пусть функция вернет true, а если нет - false */

// function otr(a) {
//     return (a == true);
// }
// console.log(otr(-1));