/*
Задача. Создайте переменную str и присвойте ей значение 'abcde'.
Обращаясь к отдельным символам этой строки выведите на экран символ 'a', символ 'b', символ 'e'.
*/

// var str = 'abcde',
//     a,
//     b,
//     e;

// a = str[0];
// console.log(a);
// b = str[1];
// console.log(b);
// e = str[4];
// console.log(e);

/*Задача. Напишите скрипт, который считает количество секунд в часе.*/
// console.log(60*60);

/*
Задача. Переделайте приведенный код так, 
чтобы в нем использовались операции +=, -=, *=, /=, ++, --. 
Количество строк кода при этом не должно измениться. Код для переделки:
*/
// var num = 1;
// num += 12;
// num -= 14;
// num *= 5;
// num /= 7;
// num += 1;
// num -= 1;
// console.log(num);

