/*Сделайте функцию, которая возвращает квадрат числа. Число передается параметром*/

// function sqr(a) {
//     return a*a
// }

// console.log(sqr(3));

/* Сделайте функцию, которая возвращает сумму двух чисел. */

// function sum(a,b) {
//     return a + b;
// }

// console.log(sum(1,2));

/* Сделайте функцию, которая отнимает от первого числа второе и делит на третье. */

// function sum(a,b,c) {
//     return (a - b) / c ;
// }

// console.log(sum(1,2,3));

/* Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке */

// function getDay(num) {
// 	var arr = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
// 	return arr[num - 1];
// }
