/* Выведите на экран таблицу умножения (как в школьной тетради).*/
// var str = '';
// for (var i = 1; i != 10; i++) {
//     for (var j = 1; j != 10; j++) {
//         str += i * j + ' ';
//     }
//     str += '\n';
// }
// console.log(str);

/* С помощью цикла for сформируйте строку '123456789' и запишите ее в переменную str */

// str = '';
// for (var i = 1; i < 10; i++) {
//     str += i;
// }
// console.log(str);

/* С помощью цикла for сформируйте строку '987654321' и запишите ее в переменную str. */

// str = '';
// for (var i = 9; i > 0; i--) {
//     str += i;
// }
// console.log(str);

/*  С помощью цикла for сформируйте строку '-1-2-3-4-5-6-7-8-9-' и запишите ее в переменную str */

// var str = '-';

// for (var i = 1; i < 10; i++) {
//     str += i + '-';
// }
// console.log(str);

/*Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5:*/
// var str = '';
// for (var i = 0; i < 10; i++) {
//     for (var j = 0; j < i; j++) {
//         str += '#';
//     } 
//     str += '\n';
// }

// console.log(str);

/*С помощью двух вложенных циклов нарисуйте следующую пирамидку:*/
// var str = '';
// for (var i = 0; i < 10; i++) {
//     for (var j = 0; j < i; j++) {
//         str += i ;
//     } 
//     str += '\n';
// }

// console.log(str);
